# Cole Weber
# Week 13 = 4/21/2021
# Pyhton - Pandas Grouping

In [1]:
import numpy as np

import pandas as pd
from pandas import Series, DataFrame

In [15]:
df = DataFrame({'city':['Alma', 'Brian Head', 'Fox Park', 'Lake Mary'], 'Altitude':[10355, 9800, 9062, 8966]})
df

         city  Altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [16]:
st_map = {'Alma':'CO', 'Brian Head':'UT', 'Fox Park':'WY', 'Lake Park':'CA'}
st_map

{'Alma': 'CO', 'Brian Head': 'UT', 'Fox Park': 'WY', 'Lake Park': 'CA'}

In [17]:
df['state'] = df['city'].map(st_map)
df

         city  Altitude state
0        Alma     10355    CO
1  Brian Head      9800    UT
2    Fox Park      9062    WY
3   Lake Mary      8966   NaN

In [11]:
def meter(x):
    return x / 3.3808

In [23]:
df['Altitude'] = df['Altitude'].apply(meter)
df

         city     Altitude state
0        Alma  3062.884524    CO
1  Brian Head  2898.722196    UT
2    Fox Park  2680.430667    WY
3   Lake Mary  2652.035021   NaN

In [26]:
df = DataFrame(np.random.randn(4, 3), columns = list('dde'))
df

          d         d         e
0  1.420277 -1.881850  0.556338
1 -0.633454  0.622317  0.583241
2 -0.562602 -0.615298 -0.574565
3  0.451793 -0.408464 -1.695931

In [28]:
def dif(s):
    return s.max() - s.min()

In [31]:
df.apply(dif, axis=1)

0    3.302127
1    1.255771
2    0.052696
3    2.147725
dtype: float64

In [36]:
df.apply(pd.value_counts).fillna(0)

             d    d    e
-1.881850  0.0  1.0  0.0
-1.695931  0.0  0.0  1.0
-0.633454  1.0  0.0  0.0
-0.615298  0.0  1.0  0.0
-0.574565  0.0  0.0  1.0
-0.562602  1.0  0.0  0.0
-0.408464  0.0  1.0  0.0
 0.451793  1.0  0.0  0.0
 0.556338  0.0  0.0  1.0
 0.583241  0.0  0.0  1.0
 0.622317  0.0  1.0  0.0
 1.420277  1.0  0.0  0.0

In [58]:
#groupby
df1 = DataFrame({'k1':['a', 'b', 'a', 'c', 'b'], 
                 'k2':['one','three','one', 'three', 'two'],
                 'set1':np.random.randn(5), 
                 'set2':np.random.randn(5)})
df1

  k1     k2      set1      set2
0  a    one -0.630042  0.300340
1  b  three  0.346891 -0.396229
2  a    one -0.546286  0.218318
3  c  three -0.038096  0.962364
4  b    two  1.128963  0.164378

In [59]:
df1.groupby(['k1', 'k2']).count()

          set1  set2
k1 k2
a  one       2     2
b  three     1     1
   two       1     1
c  three     1     1

In [60]:
df1['set1'].groupby(df1['k1']).mean()

k1
a   -0.588164
b    0.737927
c   -0.038096
Name: set1, dtype: float64

In [61]:
df1.groupby('k1').mean()

        set1      set2
k1
a  -0.588164  0.259329
b   0.737927 -0.115926
c  -0.038096  0.962364

In [62]:
df1.groupby(['k1', 'k2']).mean()

              set1      set2
k1 k2
a  one   -0.588164  0.259329
b  three  0.346891 -0.396229
   two    1.128963  0.164378
c  three -0.038096  0.962364